papo-config.org
#+title: GNU Emacs Configuration
#+author: Jacopo Costantini
#+language: en
#+options: ':t toc:nil author:t num:t
#+startup: content indent

* Early Init

#+begin_src elisp :tangle ~/.emacs.d/early-init.el
  ;;; early-init.el --- Emacs Minimal Config ;; -*- lexical-binding: t; -*-

  ;;; Commentary:

  ;;; Code:
  (defconst *is-a-mac* (eq system-type 'darwin))
  (defconst *rvm-installed* (and (file-directory-p "~/.rvm")
                                 (file-executable-p "~/.rvm/bin/rvm")))

  (setq package-enable-at-startup nil)

  ;; PERF: A second, case-insensitive pass over `auto-mode-alist' is time wasted.
  (setq auto-mode-case-fold nil)

  ;; PERF: Disable bidirectional text scanning for a modest performance boost.
  ;;   I've set this to `nil' in the past, but the `bidi-display-reordering's docs
  ;;   say that is an undefined state and suggest this to be just as good:
  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right)

  ;; PERF: Disabling BPA makes redisplay faster, but might produce incorrect
  ;;   reordering of bidirectional text with embedded parentheses (and other
  ;;   bracket characters whose 'paired-bracket' Unicode property is non-nil).
  (setq bidi-inhibit-bpa t)  ; Emacs 27+ only

  ;; Reduce rendering/line scan work for Emacs by not rendering cursors or regions
  ;; in non-focused windows.
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)

  ;; More performant rapid scrolling over unfontified regions. May cause brief
  ;; spells of inaccurate syntax highlighting right after scrolling, which should
  ;; quickly self-correct.
  (setq fast-but-imprecise-scrolling t)

  ;; Don't ping things that look like domain names.
  (setq ffap-machine-p-known 'reject)

  ;; Emacs "updates" its ui more often than it needs to, so slow it down slightly
  (setq idle-update-delay 1.0)  ; default is 0.5

  ;; Font compacting can be terribly expensive, especially for rendering icon
  ;; fonts on Windows. Whether disabling it has a notable affect on Linux and Mac
  ;; hasn't been determined, but do it anyway, just in case. This increases memory
  ;; usage, however!
  (setq inhibit-compacting-font-caches t)

  ;; Increase how much is read from processes in a single chunk (default is 4kb).
  ;; This is further increased elsewhere, where needed (like our LSP module).
  (setq read-process-output-max (* 2 1024 1024)) ; 2 MiB

  ;; Introduced in Emacs HEAD (b2f8c9f), this inhibits fontification while
  ;; receiving input, which should help a little with scrolling performance.
  (setq redisplay-skip-fontification-on-input t)

  ;;; Disable UI elements early
  ;; PERF,UI: Doom strives to be keyboard-centric, so I consider these UI elements
  ;;   clutter. Initializing them also costs a morsel of startup time. Whats more,
  ;;   the menu bar exposes functionality that Doom doesn't endorse. Perhaps one
  ;;   day Doom will support these, but today is not that day.
  ;;
  ;; HACK: I intentionally avoid calling `menu-bar-mode', `tool-bar-mode', and
  ;;   `scroll-bar-mode' because they do extra work to manipulate frame variables
  ;;   that isn't necessary this early in the startup process.
  (push '(menu-bar-lines . 0)   default-frame-alist)
  (push '(tool-bar-lines . 0)   default-frame-alist)
  (push '(vertical-scroll-bars) default-frame-alist)

  ;; And set these to nil so users don't have to toggle the modes twice to
  ;; reactivate them.
  (setq menu-bar-mode nil
        tool-bar-mode nil
        scroll-bar-mode nil)

  ;; FIX: On MacOS, disabling the menu bar makes MacOS treat Emacs as a
  ;;   non-application window -- which means it doesn't automatically capture
  ;;   focus when it is started, among other things, so enable the menu-bar for
  ;;   GUI frames, but keep it disabled in terminal frames because there it
  ;;   activates an ugly, in-frame menu bar.
  (when *is-a-mac*
    (add-hook 'window-setup-hook 'doom-restore-menu-bar-in-gui-frames-h)
    (add-hook 'after-make-frame-functions 'doom-restore-menu-bar-in-gui-frames-h)
    (defun doom-restore-menu-bar-in-gui-frames-h (&optional frame)
      (let ((use-frame (or frame (selected-frame))))
        (when (display-graphic-p use-frame)
          (set-frame-parameter use-frame 'menu-bar-lines 1)))))

  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("%b")
        ring-bell-function 'ignore
        use-dialog-box t ; only for mouse events, which I seldom use
        use-file-dialog nil
        use-short-answers t
        inhibit-splash-screen t
        inhibit-startup-screen t
        inhibit-x-resources t
        inhibit-startup-echo-area-message user-login-name ; read the docstring
        inhibit-startup-buffer-menu t)

  (setq default-input-method nil)
  (global-so-long-mode 1)

  (define-advice load-file (:override (file) silence)
    (load file nil 'nomessage))

  (setq window-resize-pixelwise t
        initial-scratch-message ";; Happy Hacking\n\n")

  ;; Reduce the frequency of garbage collection
  (setq gc-cons-threshold (* 1024 1024 80))

  (add-hook 'after-init-hook
            (lambda ()
              ;; Restore after startup
              (setq gc-cons-threshold 800000)
              (setq gc-cons-percentage 0.1)))

  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src

* Init

#+begin_src elisp :tangle ~/.emacs.d/init.el
  ;;; init.el --- Emacs Minimal Config ;; -*- lexical-binding: t; -*-

  ;;; Commentary:

  ;;; Code:

  (require 'package)
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
  (package-initialize)

  (add-to-list 'load-path (expand-file-name "lisp" user-emacs-directory))

  ;; Bootstrap `use-package`
  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))
  (eval-when-compile
    (require 'use-package))
  (setq use-package-always-ensure t
        use-package-always-defer t)

  ;; Set up custom file
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (when (file-exists-p custom-file)
    (load custom-file))

  ;; Completions
  (require 'init-ido)
  (require 'init-evil)
  (require 'init-company)

  ;; UI & UX
  (require 'init-defaults)
  (require 'init-themes)

  ;; Projects related
  (require 'init-projectile)
  (require 'init-git)

  ;; Org stuff
  (require 'init-org)

  ;; LANGS
  (require 'init-langs)

  ;; MISC
  (require 'init-misc)

  (provide 'init)
  ;;; init.el ends here
#+end_src

** IDO

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-ido.el
  ;;; init-ido.el --- Ido Configuration ;; -*- lexical-binding: t; -*-

  ;;; Commentary:

  ;;; Code:

  (use-package ido
    :config
    (setq ido-everywhere t
          ido-virtual-buffers t
          ido-use-virtual-buffers t
          ido-max-prospects 10
          ido-use-faces t
          ido-create-new-buffer 'always
          ido-default-file-method 'selected-window
          ido-default-buffer-method 'selected-window
          ido-ignore-buffers '("\\` " "^\*Mess" "^\*Back" ".*Completion" "^\*Ido")
          ido-enable-flex-matching t)
    (ido-mode))

  (use-package ido-completing-read+
    :after ido
    :config
    (ido-ubiquitous-mode 1))

  ;; Smex
  (use-package smex
    :bind (("M-x" . smex)
           ("M-X" . smex-major-mode-commands)
           ;; This is your old M-x.
           ("C-c C-c M-x" . execute-extended-command)))

  (provide 'init-ido)
  ;;; init-ido.el ends here
#+end_src

