papo-config.org
** Company

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-company.el
  ;;; init-company.el --- Company Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package company
    :demand t
    :config
    (setq company-tooltip-align-annotations t
          company-selection-wrap-around t
          company-lighter-base "©"
          company-tooltip-limit 10
          company-idle-delay 0.1
          company-minimum-prefix-length 1
          ;; company-require-match 'never
          ;; company-format-margin-function 'company-text-icons-margin
          company-tooltip-minimum 4
          ;; company-text-face-extra-attributes '(:weight bold :slant italic)
          company-text-icons-add-background nil
          company-dabbrev-other-buffers nil
          company-dabbrev-ignore-case nil
          company-dabbrev-downcase nil
          company-tooltip-flip-when-above t
          ;; company-show-quick-access 'left
          company-frontends '(company-pseudo-tooltip-frontend
                              company-echo-metadata-frontend)
          company-files-exclusions '(".git/" ".DS_Store")
          ;; company-transformers '(delete-consecutive-dups
                                 ;; company-sort-by-occurrence)
          company-global-modes '(not erc-mode message-mode help-mode))
    (global-company-mode +1))

  (use-package company-prescient
    :demand t
    :config
    (company-prescient-mode +1))

  (provide 'init-company)
  ;;; init-company.el ends here
#+end_src

** Defaults

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-defaults.el
    ;;; init-defaults.el --- Better Emacs Defaults ;; -*- lexical-binding: t; -*-
    ;;; Commentary:
    ;;; Code:

    (use-package emacs
      :ensure nil
      :demand t
      :config
      (prefer-coding-system 'utf-8)
      (set-default-coding-systems 'utf-8)
      (set-terminal-coding-system 'utf-8)
      (set-keyboard-coding-system 'utf-8)

      (electric-pair-mode +1)
      (show-paren-mode +1)
      (global-hl-line-mode +1)
      (delete-selection-mode +1)
      (subword-mode +1)
      (save-place-mode +1)

      (setq display-time-day-and-date t
            display-time-24hr-format  t
            display-time-default-load-average nil)
      (display-time-mode +1)

      (setq global-auto-revert-non-file-buffers t
            auto-revert-verbose nil
            auto-revert-use-notify nil)
      (global-auto-revert-mode +1)

      (setq-default
       line-number-mode t
       column-number-mode t
       size-indication-mode t
       fill-column 80
       blink-cursor-interval 0.4
       bookmark-default-file (locate-user-emacs-file ".bookmarks.el")
       buffers-menu-max-size 30
       case-fold-search t
       load-prefer-newer t
       ediff-split-window-function 'split-window-horizontally
       ediff-window-setup-function 'ediff-setup-windows-plain
       indent-tabs-mode nil
       tab-width 4
       auto-save-default nil
       mouse-yank-at-point t
       read-buffer-completion-ignore-case t
       read-file-name-completion-ignore-case t
       save-interprogram-paste-before-kill t
       scroll-preserve-screen-position 'always
       set-mark-command-repeat-pop t
       tooltip-delay 1.5
       truncate-lines nil
       visible-bell t
       kill-do-not-save-duplicates t
       echo-keystrokes 0.02
       truncate-partial-width-windows nil)

      ;; Make native compilation silent and prune its cache.
      (when (native-comp-available-p)
        (setq native-comp-async-report-warnings-errors 'silent) ; Emacs 28 with native compilation
        (setq native-compile-prune-cache t)) ; Emacs 29

      (setq backup-directory-alist `(("." . ,(concat user-emacs-directory "backups"))))
      ;; (setq auto-save-file-name-transforms
      ;;     `((".*" ,(concat user-emacs-directory "backups/") t)))

      (setq x-selection-timeout 100
            select-enable-clipboard t
            x-select-enable-clipboard-manager nil)

      ;; EMACS C
      (setq auto-hscroll-mode 'current-line
            auto-save-interval 64
            auto-save-timeout 2
            enable-recursive-minibuffers t
            history-delete-duplicates t
            history-length 200)

      (setq backup-by-copying t
            delete-old-versions t
            version-control t
            compilation-scroll-output 'first-error
            create-lockfiles nil
            redisplay-dont-pause t
            confirm-kill-emacs 'y-or-n-p
            undo-limit 800000
            max-lisp-eval-depth 10000
            x-stretch-cursor t)

      (when *is-a-mac*
        (setq ns-alternate-modifier 'alt
              ns-command-modifier 'meta
              ns-function-modifier 'hyper
              ns-right-alternate-modifier 'none)
        ;; Settings for the Emacs Mac-port
        (setq mac-command-modifier 'meta
              mac-option-modifier 'alt
              mac-pass-command-to-system nil))

      ;; Select treesitter langs
      (setq treesit-language-source-alist
            '((ruby "https://github.com/tree-sitter/tree-sitter-ruby")))

      ;; enable features
      (mapc (lambda (x) (put x 'disabled nil))
            '(erase-buffer upcase-region downcase-region dired-find-alternate-file narrow-to-region)))

    (use-package sudo-edit)

    (use-package helpful)

    (use-package savehist
      :ensure nil
      :config
      (setq savehist-additional-variables '(search-ring regexp-search-ring))
      (setq savehist-autosave-interval 60)
      (savehist-mode +1))

    (use-package recentf
      :ensure nil
      :config
      (setq recentf-max-saved-items 600
            recentf-exclude '("COMMIT_MSG" "COMMIT_EDITMSG" "github.*txt$"
                              "[0-9a-f]\\{32\\}-[0-9a-f]\\{32\\}\\.org"
                              ".*png$" ".*cache$"))
      (recentf-mode 1))

    (use-package buffer-move)

    (use-package winner
      :ensure nil
      :bind (("M-N" . winner-redo)
             ("M-P" . winner-undo))
      :config
      (remove-hook 'minibuffer-setup-hook 'winner-save-unconditionally)
      (winner-mode 1))

    (use-package uniquify
      :ensure nil
      :config
      (setq uniquify-buffer-name-style 'forward
            uniquify-separator "/"
            uniquify-ignore-buffers-re "^\\*"))

    (use-package display-line-numbers
      :ensure nil
      :hook prog-mode
      :config
      (setq-default
       display-line-numbers-width 3
       display-line-numbers 'relative
       display-line-numbers-current-absolute t))

    (use-package display-fill-column-indicator
      :ensure nil
      :hook prog-mode
      :config
      (setq-default
       indicate-buffer-boundaries 'left
       display-fill-column-indicator-character ?\u254e))

    (use-package dired
      :ensure nil
      :config
      (when *is-a-mac* (setq insert-directory-program "gls"))

      (setq dired-listing-switches "-laGh1v"
            list-directory-brief-switches "-CFh"
            list-directory-verbose-switches "-lhG"
            dired-recursive-deletes 'always
            dired-recursive-copies 'always
            dired-dwim-target t))

    (use-package isearch
      :ensure nil
      :config
      (setq isearch-repeat-on-direction-change t
            isearch-wrap-pause nil
            isearch-lazy-count t
            lazy-count-prefix-format "[%s of %s] "
            isearch-forward-thing-at-point '(region url email symbol sexp)
            isearch-allow-prefix t))

    (use-package multiple-cursors
      :bind (("C->" . mc/mark-next-like-this)
             ("C-<" . mc/mark-previous-like-this)
             ("C-c C-<" . mc/mark-all-like-this)))

    (use-package avy
      :bind ("C-j" . avy-goto-char-timer)
      :config
      (setq avy-timeout-seconds 0.25))

    (use-package ace-window
      :bind ("M-o" . ace-window)
      :config
      (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))

    (use-package ibuffer
      :ensure nil
      :bind (("C-x C-b" . ibuffer)))

    (use-package expand-region
      :bind ("C-=" . er/expand-region))

    (use-package which-key
      :demand t
      :config
      (which-key-mode))

    (use-package crux
      :bind (
             ("C-o" . crux-smart-open-line)
             ("C-S-o" . crux-smart-open-line-above)
             ("C-k" . crux-smart-kill-line)
             ("C-<backspace>". crux-kill-line-backwards)
             ("M-<down>" . crux-duplicate-current-line-or-region)
             ("M-S-<down>" . crux-duplicate-and-comment-current-line-or-region)
             ("C-c K" . crux-kill-other-buffers)
             ("M-j" . crux-top-join-line)

             ([remap move-beginning-of-line] . crux-move-beginning-of-line)
             ([remap kill-whole-line] . crux-kill-whole-line)))

    (use-package rainbow-delimiters
      :hook prog-mode
      ;; :diminish rainbow-mode
      )

    ;; Smartparens
    ;; (require 'smartparens-config)
    ;; (setq show-paren-delay 0)
    ;; (setq sp-highlight-pair-overlay nil)
    ;; (add-hook 'prog-mode-hook #'smartparens-mode)
    ;; (add-hook 'text-mode-hook #'smartparens-mode)

    (provide 'init-defaults)
    ;;; init-defaults.el ends here
#+end_src

** Themes

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-themes.el
  ;;; init-themes.el --- Theme Config ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package modus-themes)
  (use-package base16-theme)

  ;;(load-theme 'base16-ashes t)
  (load-theme 'modus-vivendi t)

  (set-face-attribute 'default nil :font "Iosevka" :height 130)

  (provide 'init-themes)
  ;;; init-themes.el ends here
#+end_src

** Projectile

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-projectile.el
  ;;; init-projectile.el --- Projectile Packages ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package projectile
    :bind (:map projectile-mode-map
                ("C-c p" . projectile-command-map))
    :config
    (setq projectile-per-project-compilation-buffer t
          projectile-mode-line-function '(lambda ()
                                           (format " Proj[%s]"
                                                   (projectile-project-name))))
    :init
    (projectile-mode +1))

  (provide 'init-projectile)
  ;;; init-projectile.el ends here
#+end_src

** Git

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-git.el
  ;;; init-git.el --- Git Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package magit
    :config
    (setq magit-completing-read-function #'magit-ido-completing-read))

  (provide 'init-git)
  ;;; init-git.el ends here
#+end_src

** Org

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-org.el
  ;;; init-org.el --- Org Configuration ;; -*- lexical-binding: t; -*-

  ;;; Commentary:

  ;;; Code:

  (require 'org)
  (setq org-completion-use-ido t
        org-outline-path-complete-in-steps nil)

  (use-package org-pomodoro)

  (provide 'init-org)
  ;;; init-org.el ends here
#+end_src

** Languages

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-langs.el
  ;;; init-langs.el --- Programming Languages Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (add-to-list 'load-path (expand-file-name "lisp/languages" user-emacs-directory))

  (require 'init-c-cpp)
  (require 'init-ruby)
  (require 'init-dart)
  (require 'init-data)
  (require 'init-lisp)
  (require 'init-sql)
  (require 'init-markdown)

  (use-package eglot
    :ensure nil
    :init
    (setq eglot-stay-out-of '(flymake)))

  (use-package flymake
    :ensure nil
    :hook (prog-mode . flymake-mode))

  (use-package eldoc
    :demand t
    :ensure nil
    :init
    (global-eldoc-mode +1))

  (provide 'init-langs)
  ;;; init-langs.el ends here
#+end_src

*** C/C++

#+begin_src elisp :tangle ~/.emacs.d/lisp/languages/init-c-cpp.el
  ;;; init-c-cpp.el --- C-Cpp Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  ;; C++
  (use-package modern-cpp-font-lock
    :hook (c++-mode . modern-c++-font-lock-mode))

  (provide 'init-c-cpp)
  ;;; init-c-cpp.el ends here
#+end_src

*** Ruby

#+begin_src elisp :tangle ~/.emacs.d/lisp/languages/init-ruby.el
  ;;; init-ruby.el --- Ruby Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  ;; (use-package ruby-ts-mode
  ;;   :ensure nil
  ;;   :hook (ruby-ts-mode . subword-mode)
  ;;   :mode "\\.rb\\'"
  ;;   :mode "Rakefile\\'"
  ;;   :mode "Gemfile\\'"
  ;;   :mode "\\.ru\\'"
  ;;   :custom
  ;;   (ruby-indent-level 2)
  ;;   (ruby-indent-tabs-mode nil))

  (use-package inf-ruby
    :hook ((ruby-mode    . inf-ruby-minor-mode)
           (ruby-ts-mode . inf-ruby-minor-mode)))

  (when *rvm-installed*
    (use-package rvm
      :demand t
      :config
      (message "CHIAMATO MI AI")
      (advice-add 'inf-ruby-console-auto :before #'rvm-activate-corresponding-ruby)))

  (use-package robe
    :hook ((ruby-mode    . robe-mode)
           (ruby-ts-mode . robe-mode))
    :config
    ;; (eval-after-load 'company
    ;;   '(push 'company-robe company-backends))
    )

  (use-package bundler
    :after ruby-mode)

  (use-package rspec-mode
    ;; :diminish rspec-mode
    :hook ruby-mode
    :config
    (setq rspec-use-rake-when-possible nil))

  (use-package yari
    :after ruby-mode
    :bind (:map ruby-mode-map
                ("C-c k" . yari)))

  (use-package rubocop
    :hook ((ruby-mode    . rubocop-mode)
           (ruby-ts-mode . rubocop-mode)))

  (provide 'init-ruby)
  ;;; init-ruby.el ends here
#+end_src

*** Dart

#+begin_src elisp :tangle ~/.emacs.d/lisp/languages/init-dart.el
  ;;; init-dart.el --- Dart Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package dart-mode
    :mode "\\.dart\\'"
    :bind (:map dart-mode-map
                ("C-c C-o" . dart-server-format)
                ("C-M-x"   . flutter-run-or-hot-reload)))

  (use-package dart-server
    :after dart-mode
    :hook (dart-server . flycheck-mode))

  (use-package flutter
    :after dart-mode
    :config
    (setq flutter-sdk-path "~/FlutterDev/flutter/"))

  (provide 'init-dart)
  ;;; init-dart.el ends here
#+end_src

*** Data

#+begin_src elisp :tangle ~/.emacs.d/lisp/languages/init-data.el
  ;;; init-data.el --- Data Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package csv-mode
    :hook (csv-mode . csv-guess-set-separator))

  (provide 'init-data)
  ;;; init-data.el ends here
#+end_src

