papo-config.org
*** Lisp

#+begin_src elisp :tangle ~/.emacs.d/lisp/languages/init-lisp.el
  ;;; init-lisp.el --- Lisp Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:


  ;; Paredit Cheat Sheet

  ;; Navigation
  ;; Go to the opening parenthesis: M-C-u (paredit-backward-up)
  ;; Go to the closing parenthesis: M-C-d (paredit-forward-down)

  ;; Parentheses and Quotes Manipulation
  ;; Insert balanced parentheses: M-( (paredit-wrap-round)
  ;; Slurp a parenthesis forward: C-) (paredit-forward-slurp-sexp)
  ;; Slurp a parenthesis backward: C-( (paredit-backward-slurp-sexp)
  ;; Barf a parenthesis forward: C-} (paredit-forward-barf-sexp)
  ;; Barf a parenthesis backward: C-{ (paredit-backward-barf-sexp)
  ;; Surround with quotes: M-\" (paredit-meta-doublequote)

  ;; Deletion and Killing
  ;; Delete a character forward: C-d (paredit-forward-delete)
  ;; Delete a character backward: DEL (paredit-backward-delete)
  ;; Kill a line (keeping parentheses balanced): C-k (paredit-kill)

  ;; Splitting and Joining
  ;; Split an s-expression: M-S (paredit-split-sexp)
  ;; Join two s-expressions: M-J (paredit-join-sexps)
  (use-package paredit
    :hook ((emacs-lisp-mode lisp-mode lisp-interaction-mode scheme-mode) . paredit-mode))

  (use-package elisp-slime-nav
    :hook ((emacs-lisp-mode . turn-on-elisp-slime-nav-mode)
           (ielm-mode       . turn-on-elisp-slime-nav-mode)))

  (use-package slime
    :commands slime
    :config
    ;; (setq inferior-lisp-program "/path/to/your/lisp-implementation") ; es. sbcl, clisp, ecc.
    (setq slime-contribs '(slime-fancy slime-company)))

  (use-package slime-company
    :after (slime company)
    :config
    (setq slime-company-completion 'fuzzy
          slime-company-after-completion 'slime-company-just-one-space))

  (provide 'init-lisp)
  ;;; init-lisp.el ends here
#+end_src

*** Sql

#+begin_src elisp :tangle ~/.emacs.d/lisp/languages/init-sql.el
  ;;; init-sql.el --- Sql Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package sqlformat
    :bind (:map sql-mode-map
                ("C-c C-f" . sqlformat))
    :hook (sql-mode . sqlformat-on-save-mode)
    :config
    (setq sqlformat-command 'pgformatter
          sqlformat-args '("-s2" "-g")))

  (use-package sqlup-mode
    :bind (:map sql-mode-map
                ("C-c u" . sqlup-capitalize-keywords-in-region))
    :hook ((sql-mode . sqlup-mode)
           ;; Capitalize keywords in an interactive session (e.g. psql)
           (sql-interactive-mode . sqlup-mode))
    :config
    (add-to-list 'sqlup-blacklist "name"))

  (provide 'init-sql)
  ;;; init-sql.el ends here
#+end_src

*** Markdown

#+begin_src elisp :tangle ~/.emacs.d/lisp/languages/init-markdown.el
  ;;; init-markdown.el --- Markdown Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package markdown-mode
    :magic "\\.md\\'")

  (provide 'init-markdown)
  ;;; init-markdown.el ends here
#+end_src


** Miscellaneous

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-misc.el
  ;;; init-misc.el --- Miscellaneous Packages Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (add-to-list 'load-path (expand-file-name "lisp/miscellaneous" user-emacs-directory))

  (require 'init-yasnippet)
  (require 'init-docker)
  (require 'init-gnus)

  (provide 'init-misc)
  ;;; init-misc.el ends here
#+end_src

*** Yasnippet

#+begin_src elisp :tangle ~/.emacs.d/lisp/miscellaneous/init-yasnippet.el
    ;;; init-yasnippet.el --- Yasnippet snippets ;; -*- lexical-binding: t; -*-
    ;;; Commentary:
    ;;; Code:

    (use-package yasnippet
      :hook (prog-mode . yas-minor-mode)
      :config
      (setq yas-snippet-dirs (list (concat user-emacs-directory "snippets")))
      (push '(company-semantic :with company-yasnippet) company-backends)
      (yas-reload-all))

    (use-package yasnippet-snippets
      :after yasnippet)

    (provide 'init-yasnippet)
    ;;; init-yasnippet.el ends here
#+end_src

*** Docker

#+begin_src elisp :tangle ~/.emacs.d/lisp/miscellaneous/init-docker.el
  ;;; init-docker.el --- Better Emacs Docker ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package docker)
  (use-package docker-compose-mode)
  (use-package dockerfile-mode
    :config
    (put 'dockerfile-image-name 'safe-local-variable #'stringp))

  (provide 'init-docker)
  ;;; init-docker.el ends here
#+end_src

*** Gnus

#+begin_src elisp :tangle ~/.emacs.d/lisp/miscellaneous/init-gnus.el
  ;;; init-gnus.el --- Better Emacs Gnus ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package gnus
    :ensure nil
    :bind (:map gnus-group-mode-map
                ("o" . my-gnus-group-list-subscribed-groups))
    :hook ((message-mode . (lambda ()
                             (flyspell-mode t))))
    :config
    (setq gnus-article-sort-functions
          '((not gnus-article-sort-by-date)
            (not gnus-article-sort-by-number))
          ;; Patch article
          gnus-article-patch-conditions
          '( "^@@ -[0-9]+,[0-9]+ \\+[0-9]+,[0-9]+ @@" )
          ;; Specify the send mail function
          send-mail-function         'smtpmail-send-it
          message-send-mail-function 'smtpmail-send-it)

    (defun my-gnus-group-list-subscribed-groups ()
      "List all subscribed groups with or without un-read messages"
      (interactive)
      (gnus-group-list-all-groups 5)))

  (provide 'init-gnus)
  ;;; init-gnus.el ends here
#+end_src
